#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with google_container_cluster.base,
  on main.tf line 18, in resource "google_container_cluster" "base":
  18:   enable_binary_authorization = true

Deprecated in favor of binary_authorization.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_binary_authorization_policy.image_policy: Refreshing state... [id=projects/jithin-terraform-allex-test122]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_cluster.base will be created
  + resource "google_container_cluster" "base" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 16
      + enable_binary_authorization = true
      + enable_intranode_visibility = true
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 2
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + min_master_version          = "1.25.12-gke.500"
      + monitoring_service          = (known after apply)
      + name                        = "allex-gke-test-01"
      + network                     = "projects/jithin-terraform-allex-test122/global/networks/us-central1-allex-vpc-01"
      + networking_mode             = (known after apply)
      + node_locations              = [
          + "us-central1-a",
          + "us-central1-b",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "jithin-terraform-allex-test122"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/jithin-terraform-allex-test122/regions/us-central1/subnetworks/us-central1-allex-vpc-1-sb-01"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + config_connector_config {
              + enabled = false
            }
          + dns_cache_config {
              + enabled = false
            }
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + http_load_balancing {
              + disabled = false
            }
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "us-central1-gke-pods-1"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "us-central1-gke-svcs-1"
          + stack_type                    = "IPV4"
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block   = "10.255.254.0/24"
              + display_name = "subnet: us-central1-allex-vpc-1-sb-02"
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + private_cluster_config {
          + enable_private_endpoint = true
          + enable_private_nodes    = true
          + master_ipv4_cidr_block  = "192.168.33.0/28"
          + peering_name            = (known after apply)
          + private_endpoint        = (known after apply)
          + public_endpoint         = (known after apply)
        }

      + release_channel {
          + channel = "UNSPECIFIED"
        }

      + workload_identity_config {
          + workload_pool = "jithin-terraform-allex-test122.svc.id.goog"
        }
    }

  # google_container_node_pool.node_pools["allex-generic-pool-1"] will be created
  + resource "google_container_node_pool" "node_pools" {
      + cluster                     = "allex-gke-test-01"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = 32
      + name                        = "allex-generic-pool-1"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = [
          + "us-central1-a",
        ]
      + operation                   = (known after apply)
      + project                     = "jithin-terraform-allex-test122"
      + version                     = "1.25.12-gke.500"

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 1
          + min_node_count  = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = "cos_containerd"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-8"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = "svc-gke-nodes-local@svc-account-management.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "60m"
          + update = "120m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with google_container_cluster.base,
  on main.tf line 18, in resource "google_container_cluster" "base":
  18:   enable_binary_authorization = true

Deprecated in favor of binary_authorization.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`, Working Directory: ``, Workflow: `gcp_bootstrap_gke_cluster-1`*